<a href="https://colab.research.google.com/github/ephantusGachomba/IP3/blob/main/Moringa_Data_Science_Prep_W3_Independent_Project_2019_06_Ephantus_Gachomba_Python_Notebookipynb.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [5]:
import pandas as pd

# Cleaning , droping and filling missing values the telcom datasets

***Telcom_dataset***

In [6]:
Telcom_dataset = pd.read_csv('/content/Telcom_dataset.csv')
Telcom_dataset.head(2)

  PRODUTC  VALUE               DATETIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41

[2 rows x 10 columns]

In [7]:
#drop the columns "COUNTRY_A" and "COUNTRY_B" since they are useless
Telcom_dataset_AB = Telcom_dataset.drop(['COUNTRY_A' , 'COUNTRY_B'] , axis = 1)
Telcom_dataset_AB.head(3)

  PRODUTC  VALUE  ...     CELL_ID     SITE_ID
0   Voice      0  ...  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  ...  /+cKZKIp41  /+cKZKIp41
2     sms     25  ...  /u0FSD+ahi  /u0FSD+ahi

[3 rows x 8 columns]

In [9]:
#Rename the column names 'PRODUTC' to 'PRODUCT' and all other column names to match description
Telcom_dataset1_AB_Renamed = Telcom_dataset_AB.rename(columns = {'PRODUTC' : 'PRODUCT' , 'VALUE' : 'VALUE' , 'DATETIME': 'DATE_TIME', 'CELL_ON_SITE': 'CELL_ON_SITE','DW_A_NUMBER_INT' : 'DW_A_NUMBER_INT', 'DW_B_NUMBER_INT': 'DW_B_NUMBER_INT', 'CELL_ID': 'CELL_ID', 'SITE_ID': 'SITE_ID'} , inplace=False)
Telcom_dataset1_AB_Renamed.head(3)

  PRODUCT  VALUE  ...     CELL_ID     SITE_ID
0   Voice      0  ...  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  ...  /+cKZKIp41  /+cKZKIp41
2     sms     25  ...  /u0FSD+ahi  /u0FSD+ahi

[3 rows x 8 columns]

***Telkom_dataset2***

In [10]:
Telcom_dataset2 = pd.read_csv('/content/Telcom_dataset2.csv')
Telcom_dataset2.head(2)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0     sms      0  2012-05-07 23:02:06.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1   Voice      0  2012-05-07 23:03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2

[2 rows x 10 columns]

In [11]:
#drop the columns "COUNTRY_A" and "COUNTRY_B" since they are useless
Telcom_dataset2_AB = Telcom_dataset2.drop(['COUNTRY_A' , 'COUNTRY_B'] , axis = 1)
Telcom_dataset2_AB.head(2)

  PRODUCT  VALUE  ...     CELL_ID     SITE_ID
0     sms      0  ...  +854AcBQT2  +854AcBQT2
1   Voice      0  ...  +854AcBQT2  +854AcBQT2

[2 rows x 8 columns]

In [12]:
#Rename the columns
Telcom_dataset2_AB_Renamed = Telcom_dataset2_AB.rename(columns = {'PRODUCT' : 'PRODUCT' , 'VALUE' : 'VALUE' , 'DATE_TIME': 'DATE_TIME', 'CELL_ON_SITE': 'CELL_ON_SITE','DW_A_NUMBER' : 'DW_A_NUMBER_INT', 'DW_B_NUMBER': 'DW_B_NUMBER_INT', 'CELL_ID': 'CELL_ID', 'SITE_ID': 'SITE_ID'} , inplace=False)
Telcom_dataset2_AB_Renamed.head(3)

  PRODUCT  VALUE  ...     CELL_ID     SITE_ID
0     sms      0  ...  +854AcBQT2  +854AcBQT2
1   Voice      0  ...  +854AcBQT2  +854AcBQT2
2     sms      0  ...  +laSrk7g6q  +laSrk7g6q

[3 rows x 8 columns]

***Telkom_dataset3***

In [13]:
Telcom_dataset3 = pd.read_csv('/content/Telcom_dataset3.csv')
Telcom_dataset3.head(3)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B      CELLID     SIET_ID
0   Voice     61  2012-05-08 23:01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1     sms      0  2012-05-08 23:01:31.0  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  2012-05-08 23:02:59.0  ...     19e2e  +ZaaZozy/+  +ZaaZozy/+

[3 rows x 10 columns]

In [77]:
#drop the columns "COUNTRY_A" and "COUNTRY_B" since they are useless 
Telcom_dataset3_AB = Telcom_dataset3.drop(['COUNTRY_A' , 'COUNTRY_B'] , axis = 1)
Telcom_dataset3_AB.head(3)

  PRODUCT  VALUE  ...      CELLID     SIET_ID
0   Voice     61  ...  +38u2u/rfx  +38u2u/rfx
1     sms      0  ...  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  ...  +ZaaZozy/+  +ZaaZozy/+

[3 rows x 8 columns]

In [83]:
#rename the column values to the ones given in descripton
Telcom_dataset3_AB_Renamed = Telcom_dataset3_AB.rename(columns = {'PRODUCT' : 'PRODUCT' , 'VALUE' : 'VALUE' , 'DATE_TIME': 'DATE_TIME', 'CELL_ON_SITE': 'CELL_ON_SITE','DW_A_NUMBER_INT' : 'DW_A_NUMBER_INT', 'DW_B_NUMBER_INT': 'DW_B_NUMBER_INT', 'CELLID': 'CELL_ID', 'SIET_ID': 'SITE_ID'} , inplace=False)
Telcom_dataset3_AB_Renamed.tail()

     PRODUCT  VALUE  ...     CELL_ID     SITE_ID
4996   Voice      0  ...  2aa04dcab7  f7d63a29e5
4997   Voice     62  ...  7f1f2f889f  b4ddb9e93c
4998   Voice     32  ...  a4731e780e  d68260ef50
4999   Voice     30  ...  98ed726da2  b4130b54ab
5000   Voice     60  ...  1c11a2fcbb  6d70dae094

[5 rows x 8 columns]

# Merging the 3 datasets

In [16]:
Telcom_dataset1_AB_Renamed.tail(3)

     PRODUCT  VALUE  ...     CELL_ID     SITE_ID
4998   Voice      0  ...  7773627c12  9ef9616350
4999   Voice      0  ...  3f4af49d6c  969b8d0e39
5000   Voice      7  ...  6f4d9b77a5  ebfc58af70

[3 rows x 8 columns]

In [17]:
Telcom_dataset2_AB_Renamed.tail(3)

     PRODUCT  VALUE  ...     CELL_ID     SITE_ID
4998     sms      0  ...  fe70e431df  c7ea989264
4999    data      0  ...  ffa6759bb2         NaN
5000   Voice      0  ...  8630058aca  b47a998a3e

[3 rows x 8 columns]

In [18]:
Telcom_dataset3_AB_Renamed.tail(3)

     PRODUCT  VALUE  ...     CELL_ID     SITE_ID
4998   Voice     32  ...  a4731e780e  d68260ef50
4999   Voice     30  ...  98ed726da2  b4130b54ab
5000   Voice     60  ...  1c11a2fcbb  6d70dae094

[3 rows x 8 columns]

In [95]:
Merge_Tel1_Tel2 = pd.merge(Telcom_dataset1_AB_Renamed , Telcom_dataset2_AB_Renamed , how = 'outer')
Merge_Tel1_Tel2_Tel3 = pd.merge(Merge_Tel1_Tel2 , Telcom_dataset3_AB_Renamed , how = 'outer')
Merge_Tel1_Tel2_Tel3.tail(3)

      PRODUCT  VALUE  ...     CELL_ID     SITE_ID
15000   Voice     62  ...  7f1f2f889f  b4ddb9e93c
15001   Voice     30  ...  98ed726da2  b4130b54ab
15002   Voice     60  ...  1c11a2fcbb  6d70dae094

[3 rows x 8 columns]

In [85]:
#find the most commonly used product
Merge_Tel1_Tel2_Tel3['PRODUCT'].value_counts()

sms      7071
Voice    5666
data     2266
Name: PRODUCT, dtype: int64

In [86]:
#find the most common cell_ID
Merge_Tel1_Tel2_Tel3['CELL_ID'].value_counts()

ffa6759bb2    1996
03ee801971      75
cc7ce19d6b      65
d22224b2fa      43
b78724d6fc      42
              ...
a59ca30cc9       1
48956d55cd       1
be43441a0e       1
QoPIvep4S8       1
f663a02e3f       1
Name: CELL_ID, Length: 2677, dtype: int64

# Analysis of telcom data

In [88]:
Merge_Tel1_Tel2_Tel3.head(3)

  PRODUCT  VALUE  ...  DW_B_NUMBER_INT     CELL_ID
0   Voice      0  ...  1a49f8b0ded9de6  /TJNe+Mmtu
1     sms      0  ...  93343ba6e41af95  /+cKZKIp41
2     sms     25  ...  7aacc9709ce0a20  /u0FSD+ahi

[3 rows x 7 columns]

# Loading the cells_geo

In [96]:
cells_geo = pd.read_csv('/content/cells_geo.csv' , sep = ";" , index_col=0 )
cells_geo.head(2)

   VILLES      STATUS LOCALISATION  ... AREA     CELL_ID   SITE_CODE
0  ADJAME  In Service      ABIDJAN  ...  NaN  fbb2e75af3  0bb492ef17
1  ADJAME  In Service      ABIDJAN  ...  NaN  1502501d78  0bb492ef17

[2 rows x 11 columns]

In [97]:
#Rename the SITE_CODE to SITE_ID since they have similar column values
cells_geo1 = cells_geo.rename(columns = {'SITE_CODE':'SITE_ID'})
cells_geo1.tail(2)

        VILLES      STATUS LOCALISATION  ...          AREA     CELL_ID     SITE_ID
3972  ZUENOULA  In Service    INTERIEUR  ...  CENTRE NORTH  d4a6a0b645  61bee9c70c
3973  ZUENOULA  In Service    INTERIEUR  ...  CENTRE NORTH  f9f3e42589  61bee9c70c

[2 rows x 11 columns]

# Merge cells_geo and Telcom data sets and analyse it

In [98]:
merged_cells_telcom = Merge_Tel1_Tel2_Tel3.merge( cells_geo1 , how ='outer' , on = 'SITE_ID')
merged_cells_telcom.head(3)

  PRODUCT  VALUE              DATE_TIME  ... REGION AREA CELL_ID_y
0   Voice    0.0  2012-05-06 23:04:37.0  ...    NaN  NaN       NaN
1     sms    0.0  2012-05-06 23:40:48.0  ...    NaN  NaN       NaN
2     sms    0.0  2012-05-07 23:32:47.0  ...    NaN  NaN       NaN

[3 rows x 18 columns]

In [99]:
#find the most common villes(city)
merged_cells_telcom['VILLES'].value_counts()

YOPOUGON    8726
ABOBO       6278
COCODY      3830
ADJAME      2706
KOUMASSI    2338
            ...
ALLOKOI        3
KLOTOU         3
KOTOULA        2
DANANON        2
OUANGOLO       1
Name: VILLES, Length: 504, dtype: int64

In [105]:
#get rid of the duplicate columns
merged_cells_telcom.drop_duplicates().tail(3)

      PRODUCT  VALUE DATE_TIME  ...       REGION           AREA   CELL_ID_y
56429     NaN    NaN       NaN  ...  MOYEN COMOE           EAST  79fa800efc
56430     NaN    NaN       NaN  ...       LAGUNE  ABIDJAN SOUTH  eb76e06e8e
56431     NaN    NaN       NaN  ...       LAGUNE  ABIDJAN SOUTH  e3d9d0ca54

[3 rows x 18 columns]

In [109]:
#drop rows that have more than 8 missing values
merged_cells_telcom.dropna(thresh = 8).tail(3)

      PRODUCT  VALUE DATE_TIME  ...       REGION           AREA   CELL_ID_y
56429     NaN    NaN       NaN  ...  MOYEN COMOE           EAST  79fa800efc
56430     NaN    NaN       NaN  ...       LAGUNE  ABIDJAN SOUTH  eb76e06e8e
56431     NaN    NaN       NaN  ...       LAGUNE  ABIDJAN SOUTH  e3d9d0ca54

[3 rows x 18 columns]

In [113]:
#finding the most valuable product
merged_cells_telcom.groupby(['PRODUCT'] , as_index=False).mean()

  PRODUCT      VALUE  LONGITUDE  LATITUDE
0   Voice  55.401204  -4.748652  6.047994
1    data   7.628861        NaN       NaN
2     sms   7.879369  -4.566909  5.762720

In [53]:
Data1 = {'country' : ['kenya' , 'kigali' , 'ethiopia' , 'canada'],
         'pop':[200,300,400,500],
         'cars':['honda', 'toyota' , 'benz','nissan']}
file1 = pd.DataFrame(Data1)
file1

    country  pop    cars
0     kenya  200   honda
1    kigali  300  toyota
2  ethiopia  400    benz
3    canada  500  nissan

In [54]:
Data2 = {'country' : ['somalia' , 'kenya' , 'usa' , 'pakistan' , 'ethiopia'],
         'cars' : ['hyundai'  , 'honda' , 'jeep' , 'boeing cars' , 'benz'],
         'continent' : ['africa' , 'africa' , 'america' , 'asia' , 'africa']}
file2 = pd.DataFrame(Data2)
file2

    country         cars continent
0   somalia      hyundai    africa
1     kenya        honda    africa
2       usa         jeep   america
3  pakistan  boeing cars      asia
4  ethiopia         benz    africa

In [59]:
file3 = file1.merge( file2 , how = 'outer' , on = ['country','cars'])
file3

    country    pop         cars continent
0     kenya  200.0        honda    africa
1    kigali  300.0       toyota       NaN
2  ethiopia  400.0         benz    africa
3    canada  500.0       nissan       NaN
4   somalia    NaN      hyundai    africa
5       usa    NaN         jeep   america
6  pakistan    NaN  boeing cars      asia